{
  "statusses": [
    { "class": "wip-banner", "text": "Work In Progress" },
    { "class": "done-banner", "text": "Done" },
    { "class": "abandoned-banner", "text": "Archived" }
  ],
  "projects": [
    {
      "placement": 0.1,
      "id": "looper",
      "title": "Looper Inc.",
      "status": 0,
      "description": "\\{Looper Inc.\\} is a bit of a passion project that started in 2022, when I made a game for school. Sadly, shortly after finishing the game, my computer's SSD drive broke, and the game was lost. The game was not very impressive in any kind of way, as it was made in only 4 months, and it was my first time ever designing and making an actual game. \\{Looper Inc.\\} aims to be a remake and, if possible, a finalisation of the game.<br /> <br /> But now about the gameplay: <br /> \\{Looper Inc.\\} is a movement based game inspired by games such as \\{Karlson\\} and \\{Titanfall 2\\}, featuring high-speed movement and parkour. However, it also features a unique mechanic:  \\{Time Travel\\} <br /> <br /> More specifically, \\{Time Reversal\\}, mostly inspired but the movie \\{Tenet\\} or the game \\{The Entropy Centre\\}<br /> <br /> Development is still in its earliest stages and scince I do not have much free time to spend on this project, this project is not ready to be finished anytime soon.",
      "show": true
    },
    {
      "placement": 1,
      "id": "mazeswap",
      "title": "MAZESWAP",
      "status": 1,
      "description": "For the \\{GMTK Game Jam\\} of \\{2023\\}, which had the theme \\{Roles Reversed\\}, me and a friend worked together on making a game in \\{p5.js\\}. The end result was a fun little two-player game in where you hunt each other down in a maze while trying to find the exit.",
      "buttons": [
        {
          "text": "<Source Code/>",
          "destination": "https://github.com/Twan-Reijinga/MazeSwap"
        },
        {
          "text": "Play The Game",
          "destination": "https://c0der23.itch.io/mazeswap"
        }
      ],
      "show": true
    },
    {
      "placement": 3,
      "id": "superchess",
      "title": "Superhot Chess",
      "status": 2,
      "description": "A while ago, I wanted to try to create a version of chess where both players submit and make their move at the same time. The game would end when the king piece was slain, not checkmated, and if two pieces walked to the same place, the higher ranking one would win or they would annihilate each other. Sadly, I stopped working on the project before I had a complete chess game. I am unsure whether I want to return to this project.",
      "buttons": [],
      "show": false
    },
    {
      "placement": 2,
      "id": "traffic",
      "title": "Traffic Lights AI",
      "status": 1,
      "description": "Together with a friend, attempted to create a \\{traffic simulation\\} that uses \\{AI\\} to control \\{traffic lights\\}. The idea was to find out wether AI is able to manage traffic lights more efficiently than the \\{Dutch Traffic System\\}, which is quite hard to do, scince the Dutch system is one of the most elaborate systems in the world. <br><br>We ended up concluding that at least in our case, AI is unable to solve our problem. You can download the source code by using the button down below.",
      "buttons": [
        {
          "text": "<Source Code/>",
          "destination": "https://github.com/Twan-Reijinga/TrafficLight-AI"
        }
      ],
      "show": true
    },
    {
      "id": "vr",
      "title": "VR Game Project",
      "status": 0,
      "description": "Lately, I've been trying to learn \\{VR developement\\} in Unity. However I am unsure wether I want to make a project with it later. I do have some \\{ideas\\} for what I want to make with it, but these are still deep in the ideas drawer.",
      "buttons": [],
      "show": false
    }
  ]
}
